Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །ཚངས་པའི་སྟོབས་དང་ཚངས་ནོར་ཚངས་པའི་མཆོག །ཚངས་པའི་ལྷར་བཅས་དེ་བཞིན་ཚངས་པའི་དབྱངས།
en: “Brahmābala, Brahmavasu, Subrahma, Brahmādeva and similarly Brahmaghoṣa,

source: །ཚངས་པའི་དབང་ཕྱུག་ཚངས་པའི་མི་དབང་སྤྱན།
en: Brahmeśvara, Brahma­narendra­netra,

source: །ཚངས་པའི་སྒྲ་དབྱངས་ཡན་ལག་ཚངས་པས་བྱིན།
en: Brahmasvarāṅga, Brahmadatta, {18}

source: །གཟི་བརྗིད་སྟོབས་དང་གཟི་ལྡན་གཟི་བརྗིད་མཆོག །གཟི་བརྗིད་དབང་ཕྱུག་གཟི་བརྗིད་མངོན་པར་འཕགས།
en: “Tejobala, Tejavati, Sutejas, Tejeśvara and Tejasamudrata,

source: །གཟི་བརྗིད་ཁྱབ་དང་གཟི་བརྗིད་ཤིན་ཏུ་ངེས།
en: Tejovibhu and Tejaviniścita,

source: །གཟི་བརྗིད་སྒྲ་དབྱངས་ཤིན་ཏུ་རྣམ་གྲགས་གཟི།
en: Tejasvarendra and Suvighuṣṭatejas, {19}

source: །འཇིགས་བཙན་སྟོབས་དང་འཇིགས་བཙན་བློ་གྲོས་དང་། །ཤིན་ཏུ་འཇིགས་བཙན་འཇིགས་ཞལ་འཇིགས་བཙན་འཕགས།
en: “Bhīṣmabala, Bhīṣmamati, Subhīṣma, Bhīṣmānana and Bhīṣmasamudgata,

source: །འཇིགས་བཙན་འོད་འཕྲོ་འཇིགས་མཆོག་འཇིགས་པའི་དབྱངས།
en: Bhīṣmārci, Bhīṣmottara, and Bhīṣmaghoṣa—

source: །འཇིག་རྟེན་རྣམ་འདྲེན་རྒྱལ་བ་འདི་དག་བྱུང་།
en: These jinas were guides of the world. {20} “Gambhīraghoṣa and Śiridhāraṇa,

source: །སྒྲ་དབྱངས་ཟབ་མོ་དང་ནི་དཔལ་འཛིན་དང་། །རྣམ་དག་སྒྲ་ཡི་དབང་ཕྱུག་ཚངས་པའི་དབྱངས།
en: Viśuddha­ghoṣeśvara, Śuddhaghoṣa,

source: །མཐའ་ཡས་དབྱངས་དང་ཤིན་ཏུ་རྣམ་གྲོལ་དབྱངས།
en: Anantaghoṣa, Suvimuktaghoṣa,

source: །བདུད་ཀྱི་སྟོབས་དང་བདུད་རྣམས་སྐྲག་བྱེད་དང་། །སྤྱན་བཟངས་དང་ནི་ཞལ་གཙང་སྤྱན་དག་དང་། །རྣམ་པར་དག་པའི་སྤྱན་དང་མཐའ་ཡས་སྤྱན།
en: Mārabala and Māravitrāsana, {21} “Sunetra, Śuddhānana, Netraśuddha, Viśuddhanetra and Anantanetra,

source: །ཀུན་ནས་སྤྱན་དང་རྣམ་པར་གྲགས་པའི་སྤྱན།
en: Samantanetra and Vighuṣṭanetra,

source: །སྤྱན་གྱིས་ཟིལ་གྱིས་གནོན་དང་མ་སྨད་སྤྱན།
en: Netrābhibhu, Netrānindita, {22}

source: །དུལ་མཆོག་དུལ་དང་ཤིན་ཏུ་དུལ་བའི་སེམས།
en: “Dāntottara, Dānta, Sudāntacitta,

source: །དུལ་རབ་ཞི་བའི་དབང་པོ་ཞི་བའི་ཡིད།
en: Sudānta, Śāntendriya, Śāntamānasa,

source: །ཞི་བའི་བླ་མ་ཞི་དཔལ་རབ་ཏུ་ཞི།
en: Śāntottara, Śāntaśirin, Praśānta,

source: །ཞི་བའི་ཕ་རོལ་ཕྱིན་དང་ཞི་བར་དཔའ།
en: Śāntīya­pāraṃgata and Śāntiśūra, {23}

source: །བླ་མར་གནས་པ་ཞི་བ་དུལ་བར་སེམས།
en: “Sthitottara, Śānta, Sudāntacitta,

source: །ཤིན་ཏུ་དུལ་དང་ཞི་དབང་ཞི་བའི་ཡིད།
en: Sudānta, Śāntendriya, Śāntamānasa,

source: །ཞི་བའི་བླ་མ་ཞི་བའི་དཔལ་འབར་བ།
en: Śāntottara, Śānta­śriya­jvalanta,

source: །ཞི་བ་རབ་ཞི་དབང་ཕྱུག་ཞི་བར་དཔའ།
en: Śānta, Praśānteśvara, Śāntiśūra, {24} “Gaṇendra, Gaṇamukhya, and Gaṇeśvara,

source: །ཚོགས་དབང་ཚོགས་གཙོ་ཚོགས་ཀྱི་དབང་ཕྱུག་དང་། །ཚོགས་རྣམས་ཟིལ་གནོན་ཚོགས་བཟང་ཡེ་ཤེས་གཙང་།
en: Gaṇābhibhu, Gaṇivara, Śuddhajñānin,

source: །ཚོགས་ཀྱི་དབང་ཆེན་ཚོགས་དབང་དཔའ་བོ་དང་། །གཞན་ཡང་ཚོགས་བཟང་རབ་ཏུ་རྣམ་པར་འབྱེད།
en: Mahāgaṇendra and Gaṇendraśūra,

source: །ཆོས་ཀྱི་རྒྱལ་མཚན་དེ་བཞིན་ཆོས་ཀྱི་ཏོག །ཆོས་ཀྱི་བླ་མ་ཆོས་ཀྱི་རང་བཞིན་འཕགས།
en: And also Gaṇivara­pramocaka, {25} “Dharmadhvaja and similarly Dharmaketu, Dharmottara, Dharma­svabhāvodgata,

source: །ཆོས་ཀྱི་སྟོབས་ལྡན་ཆོས་བཟང་དཔའ་བོ་དང་། །རང་བཞིན་ཆོས་ཀྱི་བླ་མ་ངེས་པ་བྱུང་།
en: Dharmabala and Sudharmaśūra,

source: །རང་བཞིན་ཆོས་ཀྱི་བླ་མ་ངེས་པར་ནི།
en: And Svabhāva­dharmottara­niścita. {26}

source: །མཚན་གཅིག་པ་ཡང་བྱེ་ཕྲག་བརྒྱད་ཅུ་སྟེ།
en: “Also there were eight hundred million with the same name Of Svabhāva­dharmottara­niścita.

source: །བསྐལ་པ་གཉིས་ལ་འདྲེན་པ་འདི་དག་བྱུང་།
en: These are the guides that appeared in two eons.

source: །བྱང་ཆུབ་ཕྱིར་ནི་འདི་དག་ངས་མཆོད་དེ། །རང་བཞིན་ཆོས་ཀྱི་བླ་མ་ངེས་པ་ཡི།
en: I made offerings to them for the sake of enlightenment. {27}

source: །རྒྱལ་བའི་མཚན་རྣམས་གང་དག་ཉན་བྱེད་ཅིང་།
en: “Whoever hears the name of those jinas, Svabhāva­dharmottara­niścita,

source: །ཐོས་ནས་རྣམ་པར་གྲགས་པའི་མཚན་འཛིན་ན།
en: And having heard it remembers that renowned name,

source: །དེ་དག་མྱུར་དུ་ཏིང་འཛིན་འདི་ཐོབ་འགྱུར།། །།འཕགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོའི་མདོ། །བམ་པོ་དྲུག་པ།
en: They will quickly attain this samādhi.” {28}

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་མང་པོའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྔོན་བྱུང་བའི་ལེའུ་འདི་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་རྒྱ་ཆེར་རྒྱས་པར་རབ་ཏུ་བསྟན་ཏོ། །སངས་རྒྱས་འདི་དག་གི་ཡང་ཕ་རོལ་ན།
en: Then the Bhagavān, through many verses, taught extensively to the youth Candraprabha the samādhi entranceway accomplished by many buddhas in the past.

source: །བསྐལ་པ་བསམ་ཡས་དཔག་ཏུ་མེད་པའི་ཚེ།
en: “After inconceivable, countless eons Following these buddhas,

source: །ལྷ་མིས་མཆོད་པ་སངས་རྒྱས་གཞན་ཞིག་བྱུང་། །དེ་ཡི་མཚན་ནི་མི་དབང་དབྱངས་ཞེས་བྱ།
en: There was a buddha named Narendraghoṣa, To whom humans and devas made offerings. {29}

source: །དེ་བཞིན་གཤེགས་པ་མི་དབང་དབྱངས་ཀྱི་ནི།
en: “Tathāgata Narendraghoṣa

source: །ཚེ་ཚད་ལོ་གྲངས་བདུན་ཁྲི་དྲུག་སྟོང་སྟེ།
en: Lived for seventy-six thousand years,

source: །ཉན་ཐོས་དག་ནི་བྱེ་བ་བརྒྱ་ཕྲག་གསུམ།
en: And three billion śrāvakas

source: །དེ་ཡི་འདུས་པ་དང་པོར་གྱུར་པ་ཡིན།
en: Gathered for his first assembly. {30} “At that time he had a shining saṅgha

source: །མངོན་ཤེས་དྲུག་ལྡན་གསུམ་རིག་དབང་པོ་ཐུལ།
en: Of those who had the six higher cognitions, the three knowledges,

source: །མཐུ་ཡང་ཆེ་ཞིང་རྫུ་འཕྲུལ་ཆེན་པོ་སྟེ།
en: Subdued senses, great powers, great miracles,

source: །ཟག་པ་ཟད་པ་ཐ་མའི་ལུས་འཛིན་པ།
en: The cessation of outflows, and who were in their last bodies. {31}

source: །འོད་མཛད་ཀྱི་ནི་དགེ་འདུན་དེ་ཚེ་བྱུང་།
en: “There was a saṅgha of bodhisattvas

source: །བྱེ་བ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་བརྒྱད་ཅུ་ཡི། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚོགས་བྱུང་སྟེ།
en: Who numbered eight thousand quintillion.

source: །བློ་གྲོས་ཟབ་ཅིང་གྲགས་པ་ཤིན་ཏུ་ཆེ།
en: They had profound understanding, fearlessness,

source: །མཐུ་ཡང་ཆེ་ཞིང་རྫུ་འཕྲུལ་ཆེ་བར་གྱུར།
en: Great powers, and great miracles. {32}

source: །མངོན་པར་ཤེས་པ་ཐོབ་ཅིང་སྤོབས་པར་ལྡན།
en: “They had attained the higher cognitions, eloquence,

source: །སྟོང་པ་ཐམས་ཅད་རྟོགས་པར་ཁོང་དུ་ཆུད།
en: And they had realized emptiness in everything.

source: །ཞིང་ནི་བྱེ་བར་དེ་ལས་ལྷག་པར་ཡང་།
en: They miraculously went to millions of realms

source: །གང་གཱའི་བྱེ་མ་སྙེད་དུ་འཕྲུལ་གྱིས་འགྲོ །རྐང་གཉིས་གཙོ་ལ་དྲི་བ་དྲིས་ནས་ནི།
en: And to even more, as numerous as the sands of the Ganges. {33}

source: །ཕྱིར་ཡང་རྒྱལ་བ་དེ་ཡི་དྲུང་དུ་འོང་།
en: “They came into the presence of that jina And addressed questions to that supreme human.

source: །མདོ་སྡེ་སྒྲུབ་པའི་ངེས་པའི་ཚིག་ལ་མཁས།
en: They were accomplished in the sūtras and skilled in definitions.

source: །སྣང་བར་གྱུར་པ་ས་ཡི་སྟེང་ན་རྒྱུ།
en: They were shining and moved upon the earth. {34}

source: །སེམས་ཅན་དོན་ཕྱིར་སྤྱད་པ་རྣམ་སྤྱོད་དེ།
en: “They performed bodhisattva conduct for the benefit of beings.

source: །བདེ་བར་གཤེགས་པའི་སྲས་པོ་མཐུ་ཆེན་ནི།
en: They were powerful sons of the Sugata.

source: །འདོད་པའི་རྐྱེན་གྱིས་སྡིག་པ་མི་བྱེད་དེ།
en: They performed no bad actions through desire,

source: །དེ་དག་ལ་ནི་ལྷ་ཡང་སྨོན་པ་སྐྱེད།
en: And toward them even the devas developed aspirations. {35}

source: །སྲིད་པའི་འགྲོ་བར་མི་གནས་དོན་མི་གཉེར།
en: “They had no longings and were detached from the realms of existence.

source: །མཉམ་གཞག་བསམ་གཏན་གནས་པའི་སྤྱོད་ཡུལ་ཅན།
en: They were in meditation, the field of experience of remaining in dhyāna.

source: །རྣམ་པར་ངེས་པའི་དོན་ལྡན་འཇིགས་མེད་པ།
en: They had certainty in the true meaning, and were fearless.

source: །དྲི་མ་མེད་པར་རྟག་ཏུ་ཚངས་པར་སྤྱོད།
en: They maintained celibacy and were free of defilement. {36}

source: །ཚིག་ཀྱང་རྒྱུན་མི་འཆད་ཅིང་སྤོབས་པར་ལྡན།
en: “They had the confident eloquence of unceasing speech.

source: །ངེས་ཚིག་བསྟན་པའི་ཚིག་གི་དོན་ལ་མཁས།
en: They were skilled in the meaning of the words and the teaching of definitions.

source: །སངས་རྒྱས་སྲས་པོ་ཀུན་ཏུ་ཡང་དག་སྟོན།
en: They were the sons of the Buddha who taught everywhere,

source: །དགེ་བའི་ལས་རྣམས་ཀྱིས་ཀྱང་ཡོངས་སུ་བཟུང་།
en: And they perfectly possessed good karma. {37}

source: །བསྐལ་པ་མཐའ་ཡས་པར་ནི་སྤྱོད་པས་འཕགས།
en: “They maintained superior conduct throughout an infinity of eons;

source: །འདྲེན་པ་དག་གིས་རྟག་ཏུ་བསྟོད་ཅིང་བསྔགས།
en: They were always praised and extolled by the guides.

source: །རྣམ་པར་ཐར་དང་དོན་ཚིག་ཡང་དག་སྟོན།
en: They taught the words and meaning of liberation.

source: །ཚུལ་ཁྲིམས་ཤིན་ཏུ་དག་ཅིང་ཉོན་མོངས་མེད།
en: They had perfectly pure conduct free of kleśas. {38}

source: །ཆུ་ཡིས་པད་མ་བཞིན་དུ་མི་ཆགས་ཏེ།
en: “They were as unstained as a lotus by water.

source: །ཁམས་གསུམ་ལས་ནི་རྣམ་གྲོལ་བག་ཡོད་པ།
en: They were liberated from the three realms, and were vigilant.

source: །འཇིག་རྟེན་ཆོས་བརྒྱད་དག་གིས་མི་གོས་ཤིང་།
en: They were unstained by the eight worldly concerns.

source: །ལུས་ཀྱང་རྣམ་དག་ལས་ཀྱང་ཡོངས་སུ་དག །འདོད་པ་ཉུང་ཞིང་ཆོག་ཤེས་མཐུ་ཡང་ཆེ།
en: They had pure bodies and pure actions. {39} “They had contentment, great power, and few desires.

source: །ཆགས་པ་མེད་ཅིང་སངས་རྒྱས་ཡོན་ཏན་གནས།
en: They were free of grasping and were established in buddha qualities.

source: །སེམས་ཅན་ཀུན་གྱི་རྟེན་དང་དཔུང་གཉེན་ཏེ།
en: They were a refuge and friend for all classes of beings.

source: །ཚིག་ཙམ་མ་ཡིན་ནན་ཏན་སྙིང་པོར་བྱེད།
en: They considered practice, not words, as the essence. {40}

source: །གང་ལ་གནས་པ་དེ་ཉིད་གཞན་ལ་སྟོན།
en: “Wherever they dwelt, there they taught others.

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་ཡོངས་སུ་བཟུང་།
en: They were adopted by all the buddhas.

source: །རྒྱལ་བ་རྣམས་ཀྱི་མཛོད་འཛིན་ཐུགས་བརྟན་པ།
en: They were trustworthy holders of the treasure of the jinas.

source: །ཁམས་གསུམ་ཐམས་ཅད་ལ་ཡང་སྐྲག་པའི་ཡིད།
en: They were terrified of the entire three realms. {41}

source: །རབ་ཏུ་སེམས་ཞི་རྟག་ཏུ་དགོན་པར་སྤྱད།
en: “Their minds were at peace, they always had the conduct of protectors,

source: །འཇིག་རྟེན་འདྲེན་པ་རྣམས་ཀྱིས་བྱིན་བརླབས་པས།
en: And they were blessed by the guides of the world.

source: །མདོ་སྡེ་བྱེ་བ་ཕྲག་སྟོང་འཆད་པར་བྱེད།
en: They taught ten thousand million sūtras,

source: །འཆད་པ་དེ་ཡང་སངས་རྒྱས་རྣམས་ཀྱིས་བསྔགས།
en: And the buddhas praised their teachings. {42}

source: །འཇིག་རྟེན་དག་གི་ཚིག་ཀུན་རྣམ་སྤངས་ཏེ།
en: “They had forsaken all worldly words.

source: །སྟོང་པ་ཉིད་ལ་མོས་ཤིང་དོན་དམ་སྟོན།
en: They aspired to emptiness and taught the ultimate.

source: །བསྔགས་པ་མཐའ་ཡས་ཡོན་ཏན་རྒྱ་མཚོ་བཞིན། །མང་དུ་ཐོས་ཤིང་མཁས་པ་ཤེས་རབ་ལྡན།
en: They were like an ocean of good qualities; there was no end to their being praised. Their learning was vast; they were wise and endowed with knowledge. {43} “If a young man were to recite their praises

source: །གཞོན་ནུ་བསྐལ་པ་བྱེ་བ་མང་པོར་ནི། །རྒྱུན་ཆད་མེད་པར་བསྔགས་པ་རབ་བརྗོད་ཀྱང་།
en: Continuously for many millions of eons

source: །དེ་ནི་ཅུང་ཟད་ཙམ་ཞིག་བརྗོད་པར་འགྱུར།
en: He would have only uttered a small amount,

source: །རྒྱ་མཚོ་ལས་ནི་ཆུ་ཐིགས་གཅིག་པོ་བཞིན།
en: Like a drop of water from an ocean. {44}

source: །དེ་ཚེ་མི་ཡི་དབང་པོའི་དབྱངས་དེ་ནི།
en: “At that time Narendraghoṣa

source: །ཏིང་འཛིན་ཞི་བ་མཐོང་དཀའ་འདི་སྟོན་ཏེ།
en: Taught this samādhi of peace, which is difficult to see.

source: །སྟོང་གསུམ་ཆེན་པོའི་འཇིག་རྟེན་ཁམས་འདི་ཡང་།
en: This universe of a thousand million worlds

source: །ལྷ་དང་ཀླུ་རྣམས་ཀྱིས་ནི་གང་བར་གྱུར།
en: Was filled with devas and nāgas. {45}

source: །དེ་ཡིས་ཏིང་འཛིན་ཞི་བ་འདི་བཤད་ཚེ།
en: “When he taught this samādhi of peace

source: །ལྷ་དང་མི་རྣམས་གང་གཱའི་བྱེ་མ་སྙེད།
en: Devas and humans as numerous as the Ganges sands

source: །སངས་རྒྱས་ཡེ་ཤེས་ལ་ནི་མི་ལྡོག་གནས།
en: Became irreversible within the buddha’s wisdom. {46}

source: །དེར་ཡང་མི་དབང་རྒྱལ་པོ་བྱུང་བ་ནི།
en: “There was a human king, a sovereign

source: །དཔལ་གྱི་སྟོབས་ཞེས་བྱ་བ་མཐུ་ཆེ་བ།
en: Named Śirībala, who was very powerful.

source: །དེ་ལ་བུ་ཡང་བརྒྱ་ཕྲག་ལྔ་ཡོད་དེ།
en: He had five hundred sons

source: །བྱད་བཞིན་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག །རྒྱལ་པོ་དེ་ཡི་བཙུན་མོའི་འཁོར་ཀྱང་ནི།
en: Who were handsome and attractive to the sight. {47} “The king had a harem

source: །བུད་མེད་བྱེ་བ་བརྒྱ་ཕྲག་བརྒྱད་ཅུ་ཡོད།
en: Of eighty thousand million women.

source: །ས་བདག་རྒྱལ་པོ་དེ་ཡི་བུ་མོ་ཡང་།
en: The king had daughters

source: །བྱེ་བ་སྟོང་ཕྲག་བཅུ་བཞིར་ཚང་བ་བྱུང་། །དེ་ཡང་སྟོན་ཟླ་ཐ་ཆུངས་ཉ་བ་ལ།
en: Who numbered a full four hundred billion. {48}

source: །ཡན་ལག་བརྒྱད་ལྡན་གསོ་སྦྱོང་བཟུང་ནས་ནི།
en: “He took the eight poṣadha vows On the full moon day of the Kārtika month,

source: །བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱད་ཅུ་ལྷན་ཅིག་ཏུ།
en: And with the eighty thousand million others

source: །འཇིག་རྟེན་གཙོ་བོའི་དྲུང་དུ་ཉེ་བར་འོངས།
en: He came before the Lord of the World. {49}

source: །རྐང་གཉིས་གཙོ་བོའི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ།
en: “The king bowed down to the feet of the supreme human

source: །རྒྱལ་བ་དེ་ཡི་སྤྱན་སྔར་རྒྱལ་པོ་འདུག །རྒྱལ་པོ་དེ་ཡི་ལྷག་པའི་བསམ་མཁྱེན་ནས།
en: And sat down before the Jina. The supreme human knew the king’s aspiration

source: །ཏིང་འཛིན་འདི་ནི་རྐང་གཉིས་དབང་པོས་བཤད།
en: And he taught this samādhi. {50}

source: །ཏིང་འཛིན་འདི་ནི་རྒྱལ་པོ་དེས་ཐོས་ནས།
en: “When the king had heard this samādhi

source: །རྒྱལ་སྲིད་མཆིལ་མ་བཞིན་དུ་ཀུན་སྤངས་ཏེ།
en: He abandoned his kingdom as if it were spittle.

source: །གཉེན་དང་རྩ་ལག་སྡུག་པ་ཡོངས་བཏང་ནས།
en: He renounced his beloved family and kinsmen

source: །རྒྱལ་བ་དེ་ཡི་དྲུང་དུ་རབ་ཏུ་བྱུང་།
en: And entered homelessness in that jina’s teaching. {51}

source: །བུ་ཡང་བརྒྱ་ཕྲག་ལྔ་དག་རབ་བྱུང་སྟེ།
en: “His five hundred sons entered homelessness,

source: །དེ་བཞིན་བཙུན་མོའི་འཁོར་དང་སྲས་མོ་དང་། །གཉེན་བཤེས་རྩ་ལག་མང་པོ་གཞན་དག་ཀྱང་།
en: And also his harem and his daughters, And also his other relatives,

source: །བྱེ་བ་ཁྲག་ཁྲིག་བདུན་ཅུ་རྩ་དྲུག་བྱུང་།
en: Numbering seventy-five quintillion. {52}

source: །བུ་དང་ཆུང་མར་བཅས་པ་རབ་བྱུང་ནས།
en: “Having entered homelessness along with his children and wives,

source: །ཁ་ཟས་སྒྲུབ་པའི་ས་ཡང་བོར་ནས་ནི།
en: He kept to the station of acquiring alms food

source: །རྒྱུན་མ་ཆད་པར་ལོ་བརྒྱད་བར་དུ་བཅགས།
en: And steadfastly wandered in this way for eight years.

source: །འཆག་ཅིང་འགྲེང་བཞིན་འཆི་བའི་དུས་ཀྱང་བྱས།
en: While remaining in wandering his life came to an end. {53}

source: །རྒྱལ་པོའི་གླང་པོ་ཏིང་འཛིན་སེམས་དཔའ་དེ།
en: “His life having ended, that preeminent king,

source: །རྟག་པར་རབ་ཏུ་མཉམ་གཞག་དུས་བྱས་པས།
en: Being always perfectly focused on a samādhi mind,

source: །དེ་ཡང་རྒྱལ་པོའི་ཕོ་བྲང་དེར་སྐྱེས་ཏེ།
en: Was reborn into a king’s family,

source: །མངལ་གྱི་དྲི་མས་མ་གོས་བརྫུས་ཏེ་བྱུང་།
en: Appearing miraculously, unstained by a womb. {54}

source: །དེ་ཡི་ཕ་ནི་བརྟན་པའི་སྟོབས་ཞེས་བྱ།
en: “Dṛḍhabala was his father’s name.

source: །བློ་གྲོས་ཆེ་ཞེས་བྱ་བ་མར་གྱུར་ཏེ།
en: And his mother’s name was Mahāmatī.

source: །གཞོན་ནུ་བཙས་མ་ཐག་ཏུ་ཚིག་སྨྲ་བ།
en: As soon as he was born, the prince asked,

source: །འཇིག་རྟེན་མགོན་པོ་དེ་ཉིད་བཞུགས་སམ་གེ།
en: ‘Is the Lord of the World present? {55}

source: །འཇིག་རྟེན་མགོན་པོས་བདག་གི་སེམས་མཁྱེན་ནས།
en: “ ‘The Lord of the World, who knows my mind,

source: །དེ་ཕྱིར་བདག་ལ་ཞི་བའི་ཏིང་འཛིན་བཤད།
en: Taught to me the samādhi of peace.

source: །རྐྱེན་རྣམས་མེད་ཅིང་རྐྱེན་དང་བྲལ་བ་ཡང་།
en: It has no causal factors, is free of causal factors,

source: །སྲིད་པའི་འགྲོ་བ་རྣམས་ནི་གཅིག་ཏུ་བསྟན།
en: And is the one teaching for beings in existence. {56}

source: །ཆོས་རྣམས་ཀུན་གྱི་རང་བཞིན་ཕྱག་རྒྱ་གང་།
en: “ ‘It is the seal of the nature of all phenomena.

source: །མདོ་སྡེ་བྱེ་བ་ཁྲག་ཁྲིག་བྱུང་བ་དག །བྱང་ཆུབ་སེམས་དཔའི་ནོར་ནི་བླ་མེད་པ།
en: It is the transmission of a quintillion sūtras. It is the unsurpassable wealth of the bodhisattvas.

source: །ཏིང་འཛིན་འདི་ནི་རྒྱལ་བས་བཤད་མཛད་དམ།
en: Does the Jina teach this samādhi? {57}

source: །ལུས་ཀྱང་གཙང་ཞིང་དེ་བཞིན་ངག་གཙང་བ།
en: “ ‘It is the purity of the body, the purity of speech,

source: །སེམས་གཙང་དེ་བཞིན་ལྟ་བ་གཙང་མ་དང་། །དམིགས་པ་རྣམས་ལས་ཡང་དག་འདའ་བ་ཡི།
en: The purity of the mind, and the purity of view. It transcends all objects of the mind.

source: །ཏིང་འཛིན་དེ་ནི་རྒྱལ་བས་བཤད་མཛད་དམ།
en: Does the Jina teach this samādhi? {58}

source: །ཆུད་མི་ཟ་བའི་འབྲས་བུ་ཆོས་བསྟན་པ།
en: “ ‘The result of this Dharma teaching is imperishable.

source: །ལམ་མཆོག་ཡན་ལག་བརྒྱད་ལྡན་སྒོམ་པ་སྟེ།
en: It is the meditation of the supreme eightfold path.

source: །དེ་བཞིན་གཤེགས་དང་ཕྲད་ཅིང་ཤེས་རབ་རྣོ།
en: It is the sharp wisdom of the congregation of the tathāgatas.

source: །བདེན་ལ་འཇུག་དང་རྟག་ཏུ་ཆོས་ཤེས་པ།
en: It is entering truth and constant knowledge of the Dharma. {59}

source: །ཕུང་པོ་ཡོངས་ཤེས་ཁམས་རྣམས་མཉམ་པ་ཉིད།
en: “ ‘It is understanding the skandhas, the equality of the dhātus,

source: །སྐྱེ་མཆེད་རྣམ་པ་ཀུན་ཏུ་བསལ་བ་སྟེ།
en: And the complete elimination of the āyatanas.

source: །སྐྱེ་བ་མེད་པ་མངོན་སུམ་འཇུག་པ་དག །ཏིང་འཛིན་དེ་ནི་རྒྱལ་བས་བཤད་མཛད་དམ།
en: It is the direct perception of birthlessness. Does the Jina teach this samādhi? {60} “ ‘It is discernment, the wisdom that enters peace.

source: །སོ་སོ་ཡང་དག་རིག་པ་བཞི་ལ་འཇུག །ཡི་གེ་ཐམས་ཅད་དབྱེ་བའི་ཡེ་ཤེས་དང་། །དངོས་པོར་འཇུག་པ་ལས་ནི་འདའ་བ་ཡི།
en: It is the knowledge of the different categories of all letters. It is transcending focusing upon the material.

source: །དབྱངས་རྣམས་ཡོངས་སུ་ཤེས་ཤིང་དགའ་བ་ཐོབ།
en: “ ‘It is the comprehension of all sounds, and the attainment of joy.

source: །བདེ་གཤེགས་བསྔགས་པ་ལ་ཡང་དགར་གྱུར་ཅིང་།
en: It is the enjoyment of praising the sugatas.

source: །འཕགས་པ་དག་གི་ཚུལ་འཇམ་དྲང་པོ་ཡི།
en: It is the kindness and honesty that is the way of the āryas.

source: །དེས་པ་ནམ་ཡང་ཁྲོ་གཉེར་མི་བྱེད་ཅིང་།
en: “ ‘It is being pleasant and never frowning.

source: །མཉེན་ཞིང་འཇམ་པ་བཞིན་ཡང་འཛུམ་པ་སྟེ།
en: It is being friendly and gentle with a smiling face.

source: །སེམས་ཅན་མཐོང་ནས་སྔོན་དུ་སྨྲ་བ་ཡི།
en: It is being first to speak on seeing beings.

source: །ལེ་ལོ་མེད་ཅིང་བླ་མའི་རི་མོ་བྱེད།
en: “ ‘It is being without laziness and respecting the gurus.

source: །སྲི་ཞུ་ཆེ་བས་ཕྱག་འཚལ་སྡུག་པར་ལྟ།
en: It is being reverential, paying homage, and being pleasant to see.

source: །སྐྱེ་བ་དག་གིས་ཆོག་ཤེས་དཀར་བ་ཡི།
en: It is being content with whatever arises, and virtuous.

source: །འཚོ་བ་དག་ཅིང་དེ་བཞིན་དགོན་གནས་དང་། །སྦྱངས་པ་དག་ལ་གནས་ཤིང་དྲན་མི་ཉམས།
en: “ ‘It is having a pure livelihood and dwelling in solitary places. It is maintaining the disciplines of mendicancy with no loss of mindfulness.

source: །ཕུང་པོ་དང་ནི་ཁམས་ལ་མཁས་པ་ཡི།
en: It is being adept in the āyatanas and in the dhātus.

source: །སྐྱེ་མཆེད་མཁས་ཤིང་མངོན་ཤེས་ཡེ་ཤེས་དང་། །ཉོན་མོངས་བསལ་བ་དུལ་བའི་ས་རྣམས་དང་། །གསང་སྔགས་མང་པོ་ཐམས་ཅད་འཆད་པ་ཡི།
en: “ ‘It is skill in the āyatanas, and the knowledge of the higher cognitions; It is the elimination of the kleśas, and the level of self-subjugation. It is the termination of all the multitudes of mantras.

source: །སྲིད་པའི་འགྲོ་བ་ཀུན་ལས་འདའ་བ་དང་། །སྐྱེ་བ་དྲན་ཞིང་ཆོས་ལ་ནེམ་ནུར་མེད།
en: “ ‘It transcends all the states of being in existence. It is remembering previous lives and having no doubt in the Dharma.

source: །ཆོས་ལ་སེམས་ཤིང་ཐོས་པ་ཚོལ་བ་ཡི།
en: It is aspiring to the Dharma and seeking to hear it.

source: །ཁྱད་པར་འགྲོ་ཞིང་རྟག་ཏུ་སྒོམ་ལ་འཇུག །ལྟུང་བ་དག་ལ་མཁས་ཤིང་འབྱུང་བར་གནས།
en: “ ‘It is a special attainment, being always engaged in meditation. It is the knowledge of downfalls and remaining in emancipation.

source: །དེ་ལ་གནས་པས་བག་ལ་ཉལ་བ་སེལ།
en: It is the elimination of propensities through remaining in that emancipation.

source: །གང་ལས་ཡེ་ཤེས་རྣོ་བའི་མཆོག་འབྱུང་བ།
en: “ ‘It is the attainment of the perfection of sharp wisdom.

source: །མི་གཡོ་རི་བོ་བཞིན་དུ་མི་སྒུལ་བ།
en: It is being as unwavering and unshakable as a mountain.

source: །ཕྱིར་མི་ལྡོག་པའི་མཚན་དང་གཟུངས་ཀྱི་སྒོ།
en: It is the dhāraṇī entranceway that has the characteristic of irreversibility.

source: །རྟག་ཏུ་དཀར་པོའི་ཆོས་རྣམས་ཡོངས་ཚོལ་ཞིང་།
en: “ ‘It is always longing for good qualities.

source: །སྡིག་པའི་ཆོས་རྣམས་ཁོར་མོར་རྣམ་པར་སྤོང་།
en: It is always avoiding bad qualities.

source: །རྟག་ཏུ་ཉོན་མོངས་ཕྱོགས་རྣམས་རྒྱུ་བ་མེད།
en: It is never going to the side of the kleśas.

source: །བསླབ་པ་ཀུན་ལ་རྟོགས་པར་ཁོང་དུ་ཆུད།
en: “ ‘The one who is wise in mastering all training,

source: །མཁས་པ་ཏིང་འཛིན་གནས་པ་རྟོགས་པར་རིག །སེམས་ཅན་དག་གི་བསམ་པ་ཤེས་པས་སྐུལ།
en: The one who has mastered remaining in samādhi, The one who inspires beings through knowing their thoughts

source: །སངས་རྒྱས་བྱང་ཆུབ་མཆོག་ཏུ་ཆོས་ཀྱང་སྟོན།
en: Teaches the Dharma for the supreme enlightenment of buddhahood. {71}

source: །ཁྱད་པར་ཤེས་པ་སྐྱེ་བ་ཤེས་པ་དང་། །མཐའ་ཡས་ཤེས་པ་ཤིན་ཏུ་རྫོགས་པར་ཤེས།
en: “ ‘It is unique knowledge, the knowledge of births. It is infinite knowledge, completely perfect knowledge.

source: །འགྲོ་བ་ཀུན་ཏུ་མཚམས་སྦྱོར་ཤེས་པ་ཡི།
en: It is the knowledge of the transition between all existences.

source: །ཁྱིམ་གྱི་གནས་སྤངས་རབ་ཏུ་འབྱུང་བའི་སེམས།
en: “ ‘Abandoning home, aspiring to mendicancy,

source: །ཁམས་གསུམ་ལ་ཡང་མི་དགའ་མི་འཛིན་ཅིང་།
en: Finding no joy in the three realms, having no grasping,

source: །སེམས་རྣམས་རབ་ཏུ་འཛིན་ཅིང་དགའ་བྱེད་པ།
en: And rejoicing in controlling the mind:

source: །ཆོས་རྣམས་རྐང་གཉིས་གཙོ་བོ་སྟོན་མཛད་པ།
en: The supreme human teaches that Dharma. {73}

source: །སྐྱོབ་པ་ཆོས་རྣམས་ལ་ཡང་མ་ཆགས་ཤིང་།
en: “ ‘Having no attachment for phenomena,

source: །རྟག་ཏུ་ཆོས་ཀྱི་མཆོག་ཀྱང་ཡོངས་སུ་འཛིན།
en: Always grasping the supreme Dharma,

source: །ལས་ཀྱི་རྣམ་པར་སྨིན་ལ་བརྟན་མོས་པ།
en: And having a stable aspiration for the ripening of karma:

source: །ཆོས་རྣམས་རྐང་གཉིས་གཙོ་བོ་སྟོན་པ་མཛད།
en: The supreme human teaches that Dharma. {74}

source: །འདུལ་བ་ལ་ཡང་མཁས་ཤིང་རྣམ་སྨིན་ཤེས།
en: “ ‘Skill in the vinaya, knowledge of the ripening of karma,

source: །དེ་བཞིན་འཐབ་ཅིང་རྩོད་པ་ཉེ་བར་ཞི།
en: The pacification of conflict and quarrels,

source: །འཐབ་པ་མེད་ཅིང་རྩོད་པ་མེད་པའི་ས།
en: Freedom from discord, the level that is free of quarrels:

source: །བཟོད་པ་ཡང་དག་འཛིན་ཅིང་ཁྲོ་མེད་གནས།
en: “ ‘Having complete patience, never having anger,

source: །ཆོས་ལ་རྣམ་པར་ངེས་ཤིང་རྟག་ཏུ་མཁས།
en: Always having skill and certainty in the Dharma,

source: །ཚིག་རྣམས་རབ་ཏུ་འབྱེད་ལ་ཡེ་ཤེས་མཐོང་།
en: Distinguishing between words and having the insight of wisdom:

source: །ཐུགས་རྗེ་བསྐྱེད་ནས་ཆོས་རྣམས་སྟོན་པ་མཛད།
en: Having developed compassion, he teaches that Dharma. {76}

source: །སྔོན་གྱི་མཐའ་ཤེས་ཕྱི་མའི་མཐའ་ཤེས་ཏེ།
en: “ ‘He has taught the knowledge of the past, knowledge of the future,

source: །བདེ་གཤེགས་བསྟན་ལས་དུས་གསུམ་མཉམ་པ་ཉིད།
en: The equality of the three times in the teaching of the sugatas,

source: །འཁོར་གསུམ་དག་ནི་ཡོངས་སུ་ཆད་པར་གསུངས།
en: And the cessation of the three aspects of an action:

source: །རྒྱལ་བ་ཆོས་ཀྱི་བདག་པོ་དེ་སྐད་སྟོན།
en: That is what the Jina, the Lord of the Dharma, teaches. {77}

source: །སེམས་ཀྱང་རབ་ཏུ་གནས་ཤིང་རྩེ་གཅིག་དང་། །ལུས་ཀྱང་རྣམ་པར་གནས་དང་འཕགས་པའི་ས།
en: “ ‘The mind’s perfect stability and one-pointedness, The body’s perfect stability as on the level of the āryas,

source: །སྤྱོད་ལམ་དག་ཀྱང་རྟག་ཏུ་བསྲུང་བ་ཡི།
en: And at all times guarding the conduct of a mendicant:

source: །ཆོས་ནི་སྐྱེས་བུ་ཁྱུ་མཆོག་ཐུབ་པ་སྟོན།
en: That is the Dharma that the sage, the preeminent human, teaches. {78}

source: །ཁྲེལ་ཡོད་ངོ་ཚ་ཤེས་ཤིང་མཛེས་པ་དང་། །འཇིག་རྟེན་ཤེས་པ་རིགས་པའི་ཚིག་རྣམས་གསུང་།
en: “ ‘A pleasing sense of modesty and self-respect, Speaking appropriate words, knowledge of the world,

source: །ཆོས་རྣམས་འབྱུང་བ་སྲོག་ཆགས་རང་བཞིན་དང་། །བྱང་ཆུབ་དམ་པ་མཆོག་གི་ཆོས་ཀྱང་སྟོན།
en: The origination of phenomena, and the nature of beings: He teaches that Dharma of the supreme, perfect enlightenment. {79}

source: །རྗེས་སུ་ཕན་གདགས་པ་དང་ཁྲེལ་ཡོད་དང་། །མི་དགེ་བ་ཡི་སེམས་ལ་སྨོད་པ་དང་། །སྦྱངས་པ་རྗེས་སུ་མི་གཏོང་བསོད་སྙོམས་སྦྱོང་།
en: “ ‘Benefiting and having a sense of modesty, Abhorring the wickedness of the mind, Never abandoning the mendicant’s discipline, and begging for alms:

source: །ཁྲེལ་ཡོད་ངོ་ཚ་ཤེས་པ་རྟག་ཏུ་སྤྱོད།
en: “ ‘Always maintaining a sense of modesty and self-respect,

source: །བླ་མ་ལ་ཡང་གུས་སྨྲ་ལྡང་བ་དང་། །ཐོག་མ་ཉིད་ནས་ང་རྒྱལ་ཚར་བཅད་པར།
en: Speaking reverently to the guru and rising to greet him, Having overcome pride from the beginning:

source: །ཆོས་རྣམས་རྒྱལ་བ་ཆོས་རྗེ་དེ་ལྟར་སྟོན།
en: That is what the Jina, the Lord of the Dharma, teaches. {81}

source: །སེམས་ནི་ལྡང་བ་ནས་ཀྱང་སེམས་དགེ་སྟེ།
en: “ ‘That which arises from the mind is the goodness of the mind;

source: །ཡེ་ཤེས་ཁོང་དུ་ཆུད་ཅིང་རྟོགས་པར་བྱེད།
en: There is wisdom’s discrimination, and thus realization,

source: །མི་ཤེས་ཕྱོགས་རྣམས་རྟག་ཏུ་རྣམ་པར་སྤོང་།
en: And the region of ignorance is always avoided:
